3.BeanShell_Programming_in_Jmeter/Assignment 2/Excercise 2/Product Information Test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.0 r1840935">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Product Information Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="REPORT_BASE" elementType="Argument">
            <stringProp name="Argument.name">REPORT_BASE</stringProp>
            <stringProp name="Argument.value">Assignment2_Excercise2</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DATETIME" elementType="Argument">
            <stringProp name="Argument.name">DATETIME</stringProp>
            <stringProp name="Argument.value">${__time(MM-dd-yyyy-HH-mm-ss,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="488602897">
            <stringProp name="53">5</stringProp>
            <stringProp name="51">3</stringProp>
            <stringProp name="1567">10</stringProp>
            <stringProp name="53430">600</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="true">
          <stringProp name="BeanShellSampler.query">import java.net.HttpURLConnection;
import java.net.URL;
import java.nio.charset.StandardCharsets;
import org.apache.commons.io.IOUtils; 
 
URL url = new URL(&quot;https://tiki.vn/api/v2/landingpage/products?category_id=26140&amp;limit=10&amp;apikey=2cd335e2c2c74a6f9f4b540b91128e55&quot;);
HttpURLConnection con = (HttpURLConnection) url.openConnection();
con.setRequestMethod(&quot;GET&quot;);
String response = IOUtils.toString(con.getInputStream(), StandardCharsets.UTF_8);
return response;</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree>
          <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="BeanShell PostProcessor" enabled="true">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">import net.minidev.json.JSONArray;
import net.minidev.json.JSONObject;
import net.minidev.json.parser.JSONParser;
import org.apache.commons.lang.StringUtils;
import org.apache.jmeter.threads.JMeterVariables;

int totalStoreNumber = StringUtils.countMatches(new String(data),&quot;sku&quot;);
log.info(&quot;Total number of product are: &quot;+totalStoreNumber);

if(totalStoreNumber &gt;0){
	String jsonString = new String(data);
	JSONParser parser = new JSONParser(JSONParser.MODE_JSON_SIMPLE);
	JSONObject store = (JSONObject) parser.parse(data);
	JSONArray storeArray = (JSONArray) store.get(&quot;data&quot;);

	for(int i=0;i&lt;totalStoreNumber;i++){
		long productPrice = ((JSONObject) storeArray.get(i)).get(&quot;price&quot;);
		if(productPrice&gt;=900000){
			log.info(&quot;...................&quot;+i);
			log.info(&quot;id: &quot;+ ((JSONObject) storeArray.get(i)).get(&quot;id&quot;));
			log.info(&quot;sku: &quot;+ ((JSONObject) storeArray.get(i)).get(&quot;sku&quot;));
			log.info(&quot;name: &quot;+ ((JSONObject) storeArray.get(i)).get(&quot;name&quot;));
			log.info(&quot;price: &quot;+((JSONObject) storeArray.get(i)).get(&quot;price&quot;));
			log.info(&quot;price_usd: &quot;+((JSONObject) storeArray.get(i)).get(&quot;price_usd&quot;));
			log.info(&quot;...................&quot;);
		}
	}
}else{
log.info(&quot;no product&quot;);
}</stringProp>
          </BeanShellPostProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">report/${REPORT_BASE}/${DATETIME}/Summary.csv</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>